#include <stdio.h>                                 //这是编译预处理指令
int main()                                         //定义主函数
{                                                  //函数开始
	char c1, c2;                                   //定义两个字符型变量
	printf("请输入一个大写字母\n");                //提示用户输入
	scanf("%c", &c1);                              //输入一个大写字母
	c2 = c1 + 32;                                  //大写字母ASCII码加32即为对应小写字母
	printf("大写字母:%c\n小写字母:%c\n", c1, c2);  //输出转换结果
	getchar();                                     //防止程序自动结束
	getchar();                                     //防止程序自动结束
	return 0;                                      //使函数值返回0
}                                                  //函数结束
